# -*- coding: utf-8 -*-
require 'date'

data = [["書籍名", "著者名", "よみがな", "出版社", "ページ数", "販売価格", "購入価格", "ISBN_10", "ISBN_13", "寸法", "発刊日", "購入日"]]

books = [
   ["実践アジャイル　ソフトウェア開発法とプロジェクト管理", "山田　正樹", "やまだ　まさき", "ソフトウェアリサーチセンター", 268, 2500, 2650, "4883732088", "978-4883732081", "21 x 14.8 x 2", Date.new(2005, 1, 25), Date.new(2005, 2, 2)],
   ["入門LEGO MINDSTORMS NXT レゴブロックで作ってロボット", "大庭　慎一郎", "おおにわ　しんいちろう", "ソフトバンククリエイティブ", 168, 2400, 2520, "4797338253", "978-4797338256", "23 x 18.2 x 1.6", Date.new(2006, 12, 23), Date.new(2007, 1, 10)]
]

books.size.times{ |i|
   puts "------------------------------------"
   books[0].size.times{ |j|
	  puts data[0][j] + "：　" + books[i][j].to_s
   }
}

puts "------------------------------------"
